{
  "data": {
    "groupByUrlname": {
      "description": "Omaha's Java User Group [@omahajug](https://twitter.com/omahajug/). For Developer Professionals of all languages and frameworks -- traditionally those that run in the JVM including Java, Kotlin, Groovy, Micronaut, Grails, Scala, Android, Javascript, etc. More and more we also cover enterprise and web dev (👋 Typescript, React, Vue, etc) topics such as architecture, testing, security, devops, cloud (AWS, GCP, Azure), and more! Promoting the Omaha Dev community, supporting each other, sharing some pizza, and hanging out to socialize after the meetings! \nTwitter: [@omahajug](https://twitter.com/omahajug/)\nYoutube: [https://www.youtube.com/c/OmahaJavaUsersGroup-OJUG](https://www.youtube.com/c/OmahaJavaUsersGroup-OJUG)\nSite: [http://ojug.org/](http://ojug.org/)\nPlease join our Google Groups mailing list too! [https://groups.google.com/forum/#!forum/omaha-java-users-group](https://groups.google.com/forum/#!forum/omaha-java-users-group)\nProud member of [Tech Omaha](https://techomaha.com/)\n\n**Sponsors**\nThank you to [DevObsessed](https://www.devobsessed.com/) for sponsoring our Meetup.com fees!\n\nIf your group would like to sponsor OJUG, please reach out for opportunities! We'd love to have additional sponsors for meeting locations, food, and drinks!",
      "pastEvents": {
        "count": 6,
        "pageInfo": {
          "endCursor": "Mjk2Njg5MzEzOjE2OTgxODMwMDAwMDA=",
          "hasNextPage": false
        },
        "edges": [
          {
            "node": {
              "title": "Bootify.io - jump start your Spring Boot apps - with Matt Payne",
              "description": "Please join us (w/ food and drinks!) as **Matt Payne** presents \"**Bootify.io** - **jump start your Spring Boot apps**\"! Bring your laptop and code along with the presentation!\n\n**Abstract:**\nIt's one thing to read about spring boot, spring data JPA and other technology. It's even better to generate a short, self-contained, correct ready-to-run example quickly. Thomas Surmann's Bootify.io web application is fabulous for learning or starting a new application.\nCome learn about the SaaS web application Bootify.io, the \"Best developer experience for starting Spring Boot apps ‐ best practices included.\"\nWe'll discuss and work through the following (bring your laptop if you'd like to play along):\n\n1. A tour of the free tier of great SaaS that is Bootify.io\n2. Generating many to many relationships with JPA (spring data)\n3. h2Database.com - Quick & easy all Java Database with an easy-to-use web console\n4. Then we'll swap h2 out for PostgreSQL.\n5. API generation with swagger (OpenAPI) using Bootify\n6. Thymeleaf GUI that sits alongside the APIs\n7. HTMX.org is an excellent (language-neutral) way to mix AJAX into your application for single-page app-like interactivity.\n8. We'll do all the `mvn install` work in the cloud -- no heavy downloads on wifi. How? We'll demo two cloud development environments.\n9. See how quick & easy to use GitPOD.io's free tier is for cloud development environments to explore a GitHub repository.\n10. See how quick & easy GitHub's Codespaces are to use. Currently, GitHub gives away \"up to 60 hours a month free\" of Codespaces to each user.\n\nWe'll use the sample repo [https://github.com/payne/team2](https://github.com/payne/team2) that was created in minutes using Bootify.io.\n\nThe short link for this presentation is [MattPayne.org/bootify](https://mattpayne.org/bootify).\n\n**Speaker:**\nMatt Payne is an organizer of OJUG, and a great guy.\n\n**Schedule:**\nPizza and Networking: 5:30 - 6:00\nPresentation: 6:00 - 7:00\nJetbrains IntelliJ license raffle for in-person attendees after the talk!\nPost-talk drinks and conversation too!\n\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\nThank you to [Object Partners](https://objectpartners.com/) (now part of [Improving](https://improving.com/)) for sponsoring the room space, pizza, drinks, and Meetup.com site fees!\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-03-16T17:30-05:00",
              "going": 11
            }
          },
          {
            "node": {
              "title": "Intro to Apache Flink - with Nick Larson",
              "description": "Please join us (w/ food and drinks!) as **Nick Larson** presents \"**Intro to Apache Flink**\"!\n\n**Abstract:**\nApache Flink is a powerful and widely used open-source framework for distributed data processing and analytics. It offers both batch and streaming processing capabilities, high performance and scalability, and advanced features such as window operations, event time processing, and state management.\n\nIn this presentation, we will dive into the ecosystem of Apache Flink and explore its various components, such as the DataStream API and DataSet API, and the state backends available. We will also examine real-world use cases and best practices for using Flink in your data processing pipeline.\n\n**Speaker:**\nNick Larson is the VP of Technology for Improving Omaha. His career has been filled with assisting clients in their journey to a modern platform. He has become familiar with Confluent and Kafka over the past 5 years by working on various clients to leverage data streaming technologies as a fit to many problems they encounter.\n\n**Schedule:**\nPizza and Networking: 5:30 - 6:00\nPresentation: 6:00 - 7:00\nJetbrains IntelliJ license raffle for in-person attendees after the talk!\nPost-talk drinks and conversation too!\n\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\nThank you to [Object Partners](https://objectpartners.com/) (now part of [Improving](https://improving.com/)) for sponsoring the room space, pizza, drinks, and Meetup.com site fees!\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-05-18T17:30-05:00",
              "going": 11
            }
          },
          {
            "node": {
              "title": "Reactive Microservices with Spring Boot and JHipster",
              "description": "**Abstract:**\n\nMicroservice architectures are all the rage in JavaLand. They allow teams to develop services independently and deploy autonomously. Why microservices?\n\nIF you are developing a large/complex application\nAND you need to deliver it rapidly, frequently, and reliably over a long period of time\nTHEN the Microservice Architecture is often a good choice.\n\nReactive architectures are becoming increasingly popular for organizations that need to do more, with less hardware. Reactive programming allows you to build systems that are resilient to high load.\n\nIn this session, I'll show you how to use JHipster to create a reactive microservices architecture with Spring Boot, Spring Cloud, Keycloak, and run it all in Docker. You will leave with the know-how to create your own resilient apps!\n\n**Speaker:**\nMatt Raible is a web developer, java champion, developer advocate at Okta, and an international speaker.\n\n**Schedule:**\nPizza and Networking: 5:30 - 6:00\nPresentation: 6:00 - 7:00\nJetbrains IntelliJ license raffle for in-person attendees after the talk!\nPost-talk drinks and conversation too!\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\nThank you to Dev Obsessed for sponsoring the room space, pizza, drinks, and Meetup.com site fees!\n\nMeeting location: 11425 Davenport St, Omaha, NE 68154\n[https://goo.gl/maps/kYm1RyBg18x5bd5u7](https://goo.gl/maps/kYm1RyBg18x5bd5u7)\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-06-06T17:30-05:00",
              "going": 25
            }
          },
          {
            "node": {
              "title": "Java and Unikernels - Run what you Need - with Aaron Grothe",
              "description": "Please join us (w/ food and drinks!) as **Aaron Grothe** presents \"**Java and Unikernels - Run what you Need**\"!\n\nAlso **note the address:** this event will be at Object Partners/Improving's new office out west!\n\n**Abstract:**\nUnikernels take the idea of an operating system and strip it down to just what you need to run your program. This can reduce the size of your containers, reduce the potential attack surface and increase performance. There are tradeoffs as well in terms of increased complexity and reduced flexibility.\n\nThis talk will go through the basics of using Unikernels with Java with several quick demos. Hopefully, people will leave the talk with thinking about adding unikernels to their toolbox.\n\n**Speaker:**\nAaron Grothe is a Systems/Architect at an Omaha company. He's been published in 2600 magazine several times and is a two-time IOCCC winner. For more information hit his website at [https://grothe.us](https://grothe.us)\n\n**Schedule:**\nFood and Networking: 5:30 - 6:00\nPresentation: 6:00 - 7:00\nJetbrains IntelliJ license raffle for in-person attendees after the talk!\nPost-talk drinks and conversation too!\n\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\nThank you to [Object Partners](https://objectpartners.com/) (now part of [Improving](https://improving.com/)) for sponsoring the room space, food, drinks, and Meetup.com site fees!\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-08-17T17:30-05:00",
              "going": 16
            }
          },
          {
            "node": {
              "title": "Wargames Vulnerabilities & SpringBoot 2 to 3 w/ Gerrit Grunwald & Ivar Grimstad",
              "description": "A special treat for September, we have 2 great speakers from Europe on a national JUG tour stopping in Omaha -- Gerrit Grunwald from Germany, and Ivar Grimstad from Sweden -- giving 2 great talks!\n\n**Titles:**\n\n\"**Wargames - Java vulnerabilities and why you should care**\" -- from **Gerrit Grunwald** \\- Senior Developer Advocate at Azul and Münster Germany JUG leader\\!\n\n\"**From Spring Boot 2 To Spring Boot 3 with Java 21 and Jakarta EE**\" -- from **Ivar Grimstad** \\- Jakarta EE Dev Advocate at the Eclipse Foundation and Malmö Sweden JUG leader\\!\n\n**Wargames abstract:**\n\nJava is great and we all spend time on making it more performant, more scalable and maintainable. But we better should also spend some time on making it more secure. With all that new Java releases and features also come new vulnerabilities and exploits. Because Java is everywhere, it has a huge attack surface which makes it interesting for hackers to search for vulnerabilities in Java and foremost in Java based applications. I'm not a Java security specialist and if you are like me wonder what all these mystique acronyms like NVD, CVE, CVSS, CPU, PSU etc. mean and how they are related to Java security, come to this session and I will explain it to you. It will also be shown what tools are available to you to check whether your Java application is vulnerable to known issues.\n\n**Spring Boot / Java EE abstract:**\n\nJakarta EE 9 changed its package namespace from javax.\\* to jakarta.\\*. This may sound like a trivial change that mostly affects Jakarta EE. So, why should Spring developers care?\n\nAs it turns out, the namespace changes ripple throughout the entire Java ecosystem. And Spring is no exception. Spring Framework 6 and Spring Boot 3 raised their baseline to Jakarta EE 9 API level which is supported by Tomcat 10 and Jetty 11 for example.\n\nAttending this session will teach you how to make this migration as smooth as possible. A live coding demo will take you through the steps involved, and point out where to pay special attention.\n\nWe will also briefly examine some of the changes planned for Jakarta EE 11 that will prepare you for what to expect in future versions of Spring.\n\n**Wargames Speaker:**\n\n**Gerrit Grunwald** is a software engineer that loves coding for around 40 years already. He is a true believer in open source and has participated in popular projects like [JFXtras.org](JFXtras.org) as well as his own projects (TilesFX, Medusa, Enzo, SteelSeries Swing, SteelSeries Canvas, JDKMon).\n\nGerrit blogs regularly at [http://harmonic-code.org](http://harmonic-code.org), he is an active member of the Java community, where he founded and leads the Java User Group Münster (Germany), he is a JavaOne rockstar and a Java Champion. He is a speaker at conferences and user groups internationally and writes for several magazines.\n\n**Spring Boot / Java EE Speaker:**\n\n**Ivar Grimstad** is the Jakarta EE Developer Advocate at Eclipse Foundation. He is a Java Champion and JUG Leader based in Sweden.\n\nBesides advocating the Jakarta EE technologies, Ivar is contributing to the Jakarta EE specifications as well as being the PMC Lead for Eclipse Enterprise for Java (EE4J). He is also one of the specification leads for Jakarta MVC and represents Eclipse Foundation on the JCP Executive Committee.\n\nIvar is also involved in a wide range of other open-source projects and communities. He is a frequent speaker at International developer conferences.\n\n**Schedule:**\n\nPizza and Networking: 5:30 - 6:00PM\n\nPresentation 1: 6:00 - 6:45PM\n\nPresentation 2: 6:45 - 7:30PM\n\nJetbrains IntelliJ license raffle after the talk!\n\nPost-talk drinks and conversation too!\n\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\n\nThank you to [DevObsessed](https://www.devobsessed.com/) for sponsoring the room space, pizza, drinks, and Meetup.com site fees!\n\nMeeting location: 11425 Davenport St, Omaha, NE 68154\n\n[https://goo.gl/maps/kYm1RyBg18x5bd5u7](https://goo.gl/maps/kYm1RyBg18x5bd5u7)\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-09-21T17:30-05:00",
              "going": 28
            }
          },
          {
            "node": {
              "title": "Building Modern Apps with OAuth2 and Spring w/ Steve Riesenberg",
              "description": "Join us for a talk from Steve Riesenberg from the Spring Security team!\n\nNote: Moving to a Tuesday for this month to fit a few schedules - and location at DevObsessed\n\n**Building Modern Apps with OAuth2 and Spring**\n\nHave you ever been so excited to start building a shiny new application, only to lose momentum when adding security to your project? Have you ever wondered how to build application architectures that are secure from the start? Are you using Spring, but not quite sure which projects to reach for first and how they all fit together?\n\nIn this talk, we will examine a modern application architecture including multiple secured microservices, and see how various Spring projects come together to make this work. We will learn how OAuth2 fits seamlessly into this architecture to create modern applications that are resilient, adaptable and production-ready. We will also explore using Spring Boot's OAuth2 Authorization Server support to standardize our OAuth2 configuration while providing the flexibility to connect to multiple third party identity providers.\n\n—\n\nSteve Riesenberg is a Software Engineer at VMware where he works on the Spring Security team, contributing to Spring Security’s OAuth support as well as the Spring Authorization Server.\n\nHis interests are in security, distributed systems, messaging, web development, FinTech, and JVM languages such as Kotlin. He contributes occasionally in the ZeroMQ community and dabbles in home automation.\n\nHe has extensive experience developing security solutions and APIs for online banking platforms, and has worked to deploy numerous online and mobile banking systems. He enjoys working with large teams of various skill-sets and loves thinking through the user experience from the UI to the mainframe (and back again).\n\n**Schedule:**\n\nPizza and Networking: 5:30 - 6:00PM\n\nPresentation: 6:00 - 7:00PM\n\nJetbrains IntelliJ license raffle after the talk!\n\nPost-talk drinks and conversation too!\n\nFollow us on twitter! [@omahajug](https://twitter.com/omahajug/)\n\n**Sponsors:**\n\nThank you to [DevObsessed](https://www.devobsessed.com/) for sponsoring the room space, pizza, drinks, and Meetup.com site fees!\n\nMeeting location: 11425 Davenport St, Omaha, NE 68154\n\n[https://goo.gl/maps/kYm1RyBg18x5bd5u7](https://goo.gl/maps/kYm1RyBg18x5bd5u7)\n\nThank you to [Jetbrains](https://www.jetbrains.com/idea/) for sponsoring by providing an IntelliJ License that we will raffle off to the in-person attendees!\n\nAdditionally, if your group is interested in sponsoring or speaking at OJUG, please reach out for opportunities!",
              "dateTime": "2023-10-24T17:30-05:00",
              "going": 20
            }
          }
        ]
      }
    }
  }
}